Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: You can cause characters that normally function as metacharacters to be interpreted literally by prefixing them with a "\" (e.g., "\." matches a ".", not any character; "\\" matches a "\").
es_es: Puede hacer que los caracteres que normalmente funcionan como metacaracteres sean interpretados literalmente mediante un prefijado con un "\" (p.e., "\." coincide con un ".", no con cualquier carácter; "\\" coincide con un "\").

source: The fixed size array could cause C stack exhaustion on systems configured to use large numbers of groups.
es_es: El array de tamaño fijo podría provocar el agotamiento de la pila C en sistemas configurados para utilizar un gran número de grupos.

source: Another way to create anonymous filehandles is with the Symbol module or with the IO::Handle module and its ilk.
es_es: Otra forma de crear identificadores de archivo anónimos es con el módulo Symbol o con el módulo IO::Handle y sus acólitos.

# print "Defined " if defined &subroutine;
source: print "Defined\n" if defined &subroutine;
es_es: print "Definido\n" if defined &subrutina;

source: See L<perlfunc/say>.
es_es: Vea L<perlfunc/say>.

source: Binds a network address to a socket, just as bind(2) does.
es_es: Enlaza una dirección de red a un socket, como lo hace bind(2).

source: The LABEL identifies the loop for the loop control statements C<next>, C<last>, and C<redo>.
es_es: La ETIQUETA identifica el bucle para las instrucciones de control de bucle C<next>, C<last> y C<redo>.

source: For example, your locale might not think that C<LATIN SMALL LETTER ETH> is a letter (unless you happen to speak Icelandic), but Unicode does.
es_es: Por ejemplo, tu configuración regional no pensaría que C<LATIN SMALL LETTER ETH> es una letra (a menos que usted hable de Islandés), pero Unicode sí.

source: The language is intended to be practical (easy to use, efficient, complete) rather than beautiful (tiny, elegant, minimal).
es_es: El lenguaje se diseñó para ser práctico (fácil de usar, eficaz, completo), más que estético (reducido, elegante, minimalista).

source: A computer scientist will correctly explain that all programs are interpreted and that the only question is at what level.
es_es: Un científico de computación puede explicarle correctamente que, en realidad, todos los programas son interpretados y solo se diferencian en el grado en que lo son.

source: D A float of long-double precision in native format.
es_es: D Un flotante en doble-largo precisión en formato nativo.

source: Can now store code references (via B::Deparse, so not foolproof).
es_es: Ahora puede almacenar referencias a código (a través de B::Deparse, no es tan infalible).

source: Symmetrically, C<no VERSION> allows you to specify that you want a version of Perl older than the specified one.
es_es: Simétricamente, C<no VERSIÓN> le permite especificar que desea una versión de Perl más vieja que la especificada.

source: Since Perl 5.8.0 had been released for BeOS BONE, I suspect, there is a good chance, that it still compiles on a BONE system.
es_es: Desde que Perl 5.8.0 ha sido lanzado para BeOS BONE, sospecho, que es una buena oportunidad, para que todavía se pueda compilar en un sistema BONE.

source: \g{-1} [5] The number may be negative indicating a relative previous group and may optionally be wrapped in curly brackets for safer parsing.
es_es: \g{-1} [5] El número puede ser negativo, indicando la posición relativa de un grupo anterior y puede, opcionalmente, estar rodeado por llaves, para un mejor análisis de la exp. reg.

source: got <d is under the >
es_es: obtiene <, al mediodía, se >

source: Equivalent to C<< (?&NAME) >>.
es_es: Equivalente a C<< (?&NOMBRE) >>.

source: For C<pack>, you write I<length-item>C</>I<sequence-item>, and the I<length-item> describes how the length value is packed.
es_es: Para C<pack>, escriba I<longitud-item>C</>I<secuencia-item>, y la I<longitud-item> indica el valor de la longitud de lo que está empaquetado.

source: C<Pod::Functions> upgraded to version 1.03
es_es: C<Pod::Functions> actualizado a la versión 1.03

source: Math::GMP another one using an external C library
es_es: Math::GMP otro usando una biblioteca C externa

source: See L<perlmod/"Packages"> for more information about packages, modules, and classes.
es_es: Ver L<perlmod/"Paquetes"> para más información sobre paquetes, módulos y clases.

source: perlxs Perl XS application programming interface
es_es: perlxs Interfaz de programación de aplicaciones XS

source: o Compile pattern only once.
es_es: o Compila el patrón solo una vez.

source: (A simple Boolean test will not distinguish among C<undef>, zero, the empty string, and C<"0">, which are all equally false.) Note that since C<undef> is a valid scalar, its presence doesn't I<necessarily> indicate an exceptional condition: C<pop> returns C<undef> when its argument is an empty array, I<or> when the element to return happens to be C<undef>.
es_es: (Un simple test Booleano no distinguirá entre C<undef>, cero, el string vacío y C<"0">, que son todos igualmente falso). Note que como C<undef> es un escalar válido, su presencia no indica I<necesariamente> una condición excepcional: C<pop> devuelve C<undef> cuando su argumento es un array vacío, I<o> cuando el elemento a devolver sea un C<undef>.

source: See also C<unshift>, C<push>, and C<pop>.
es_es: Vea también C<unshift>, C<push>, y C<pop>.

source: Updated for perl-5.8.8 and perl-5.9.3 by Ken Hirsch.
es_es: Actualización para perl-5.8.8 y perl-5.9.3 por Ken Hirsch.

source: & 128) ? 'with' : 'without';
es_es: & 128) ? 'con' : 'sin';

source: The keys of a hash are returned in an apparently random order.
es_es: Las claves de un hash son devueltas en un aparente orden aleatorio.

source: =head2 Safety net
es_es: =head2 Red de seguridad

# $baz = ' '; # a two-character string
source: $baz = '\n'; # a two-character string
es_es: $baz = '\n'; # una cadena de dos caracteres

source: =head2 Repeated Patterns Matching a Zero-length Substring
es_es: =head2 Patrones repetidos coincidiendo con subcadenas de longitud cero

source: Note that this issue should only make a difference for disk files, as sockets and pipes have always been in "binary" mode in the Windows port.
es_es: Tenga en cuenta que este problema sólo afecta a los archivos de disco, ya que los I<sockets> y tuberías siempre han estado en modo "binario" en la versión para Windows.

source: print "Just read in this line: $_";
es_es: print "Acabo de leer esta línea: $_";

source: Commas should separate literal elements of the LIST.
es_es: Las comas deberían separar elementos literales de la LISTA.

source: Parallel makes should work properly now, although there may still be problems if C<make test> is instructed to run in parallel.
es_es: Hacer make en paralelo debería funcionar ahora correctamente, aunque todavía puede haber problemas si se indica a C<make test> que se ejecute en paralelo.

source: (To avoid this cost while retaining the grouping behaviour, use the extended regular expression C<(?: ... )> instead.) But if you never use C<$&>, C<$`> or C<$'>, then patterns I<without> capturing parentheses will not be penalized.
es_es: (Para evitar este coste mientras quiera usar el comportamiento de agrupación, use en su lugar la expresión regular extendida C<(?: ... )>). Pero si nunca usa C<$&>, C<$`> o C<$'>, entonces los patrones I<sin> paréntesis de captura no serán penalizados.

source: C<$mday> is the day of the month and C<$mon> the month in the range C<0..11>, with 0 indicating January and 11 indicating December.
es_es: C<$mdia> es el día del mes, y C<$mes> es el mes en el rango C<0..11>, con 0 indicando enero, y 11, diciembre.

source: If the selected element is outside the string, the value 0 is returned.
es_es: Si el elemento seleccionado se fuera de la cadena, se devuelve el valor 0.

source: C<telldir> has the same caveats about possible directory compaction as the corresponding system library routine.
es_es: C<telldir> también tiene las mismas advertencias sobre la posible compactación del directorio como la correspondiente rutina del sistema.

source: next if /barney/; # same effect as "last", but doesn't document as well
es_es: next if /pablo/; # mismo efecto que "last", pero no se ve muy claro

source: The expression is interpreted as a list of single characters (hyphens allowed for ranges).
es_es: La expresión se interpreta como una lista de caracteres simples (guiones permitidos para indicar rangos).

source: =head3 Character set modifiers
es_es: =head3 Modificadores del conjunto de caracteres

source: It is planned to change this behavior in 5.16, but the exact rules haven't been determined yet.
es_es: Está previsto cambiar este comportamiento en 5.16, pero las reglas exactas no se han determinado todavía.

source: Otherwise, attempting to use them raises an exception.
es_es: De lo contrario, al tratar de usarlos lanzará una excepción.

source: This page describes the syntax of regular expressions in Perl.
es_es: Esta página describe la sintaxis de las expresiones regulares en Perl.

source: # Identical to the chmod 0755 of the example above.
es_es: # Idéntico a chmod 0755 del ejemplo anterior.

source: perlmacosx has been added to tell about the installation and use of Perl in Mac OS X.
es_es: perlmacosx ha sido añadido para hablar acerca de la instalación y el uso de Perl en Mac OS X.

source: Tests for basic control structures, C<if/else>, C<while>, subroutines, etc.
es_es: Pruebas de estructuras de control básicas, C<if/else>, C<while>, subrutinas, etc.

source: This command is normally used by programs that want to lie to themselves about what was just input.
es_es: Este comando se usa, normalmente, por los programas que quieren engañarse a sí mismos sobre lo que fue introducido.

source: This means C<srand(42)> will usually produce the same results as C<srand(42.1)>.
es_es: Esto significa que C<srand(42)> produce los mismos resultados, generalmente, que C<srand(42.1)>.

source: A literal of the form C<v1.20.300.4000> is parsed as a string composed of characters with the specified ordinals.
es_es: Un literal de la forma C<v1.20.300.4000> es interpretada como una cadena compuesta de caracteres con los ordinales especificados.

source: PerlIO::get_layers(FH) returns the names of the PerlIO layers active on a filehandle.
es_es: PerlIO::get_layers(FH) devuelve los nombres de las capas PerlIO activas en un identificador de archivo.

source: The old "gnu-0.2" binary distribution will most certainly have additional problems.
es_es: La anterior distribución binaria "gnu-0.2" con toda seguridad, tiene problemas adicionales.

source: Now Perl restores the original SIGFPE handling routine, whatever it was, before running external programs.
es_es: Ahora Perl restaura la rutina de manejo de SIGFPE original, fuera cual fuera, antes de ejecutar programas externos.

source: If TEMPLATE requires more arguments than pack() is given, pack() assumes additional C<""> arguments.
es_es: Si PLANTILLA requiere más argumentos de los que se pasan a pack(), éste asume argumentos adicionales iguales a C<"">.

source: Also:
es_es: También:

source: PARNO is a sequence of digits (not starting with 0) whose value reflects the paren-number of the capture group to recurse to.
es_es: PARNO es una secuencia de dígitos (no empezando en 0) cuyo valor refleja el número del par de paréntesis del grupo de captura que hay que re-ejecutar.

source: There is a fairly obvious gotcha included with the line directive: Debuggers and profilers will only show the last source line to appear at a particular line number in a given file.
es_es: Existe obviamente un problema con esta directiva: los I<debuggers> y perfiladores sólo mostrarán la última línea del código fuente que aparece en un número de línea en particular de un determinado archivo.

source: This lets you indirectly pass arguments to the subroutine.
es_es: Esto le permite pasar argumentos indirectamente a la subrutina.

source: It may work on other versions, but that's the one we've tested it on.
es_es: Es posible que funcione en otras versiones, pero esta es la única en la que lo hemos probado.

source: place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or placing the modifications on a major archive site such as uunet.uu.net, or by allowing the Copyright Holder to include your modifications in the Standard Version of the Package.
es_es: coloque sus modificaciones en el Dominio Público o de otra manera hacerlos de Libre Disposición, o mediante la publicación de dichas modificaciones en Usenet o un medio equivalente, o la colocación de las modificaciones en sitios importantes como uunet.uu.net, o permitiendo que el Titular del Copyright incluya las modificaciones en la Versión Estándar del Paquete.

source: Interpolating it in a list has no effect.
es_es: Interpolarla en una lista no tiene ningún efecto.

source: See L<perlrun/-C> and L<perlrun/PERL_UNICODE> for more information.
es_es: Vea L<perlrun/-C> y L<perlrun/PERL_UNICODE> para más información.

source: The warnings show up both during the build of Perl and during certain lib/ExtUtils tests that invoke the C compiler.
es_es: Estas advertencias aparecen durante la compilación de Perl y durante ciertas pruebas de lib/ExtUtils que invocan al compilador de C.

source: s/Login: $foo/Login: $bar/; # run-time pattern
es_es: s/Login: $foo/Login: $bar/; # patrón en tiempo de ejecución

source: Especially alternative libraries like Math::BigInt::GMP benefit from this.
es_es: Especialmente las bibliotecas alternativas como Math::BigInt::GMP se beneficiaron de todo esto.

source: The behaviour of a smart match now depends primarily on the type of its right hand argument.
es_es: El comportamiento de una coincidencia inteligente ahora depende, principalmente, del tipo de su argumento derecho.

source: type => "text",
es_es: tipo => "texto",

source: The upshot of all this is that Perl cannot store a number like 12345678901234567 as a floating point number on such architectures without loss of information.
es_es: Como consecuencia, Perl no puede almacenar un número como 12345678901234567 en forma de número de punto flotante para estas arquitecturas sin pérdida de información.

source: # pack little-endian 16- and 32-bit signed integers
es_es: # empaqueta 16 y 32-bit enteros con signo, en little-endian

source: See L<perlipc> for more on signal handling.
es_es: Ver L<perlipc> para más información sobre el manejo de señales.

source: If you're trying to do variable interpolation, it's definitely better to use the glob() function, because the older notation can cause people to become confused with the indirect filehandle notation.
es_es: Si está tratando de hacer interpolación de variables, sin duda es mejor utilizar la función glob(), porque la notación más antigua puede hacer que las personas se confundan con la notación de identificador de archivo indirecto.

source: you may tell the compiler to use integer operations (see L<integer> for a detailed explanation) from here to the end of the enclosing BLOCK.
es_es: puede indicar al compilador que utilice operaciones con enteros (vea L<integer> para una explicación más detallada) desde aquí hasta el final del BLOQUE actual.

source: Now has bytes::substr.
es_es: Ahora tiene bytes::substr.

source: If the builtin is not I<overridable> (such as C<qw//>) or if its arguments cannot be adequately expressed by a prototype (such as C<system>), prototype() returns C<undef>, because the builtin does not really behave like a Perl function.
es_es: Si la orden interna no es yo <sobreescribible> (como lo es C<qw//>) o si sus argumentos no pueden ser adecuadamente expresados por un prototipo (como C<system>), prototype() devuelve C<undef>, porque la orden interna en realidad no se comporta como una función de Perl.

source: You may turn it off explicitly for particular portions of code via the C<no warnings> pragma or the C<$^W> variable if you must.
es_es: Puede desactivarla explícitamente en partes del código con el pragma C<no warnings> o con la variable C<$^W> si así lo desea.

source: Pseudo-hashes were deprecated in Perl 5.8.0 and will be removed in Perl 5.10.0, see L<perl58delta> for details.
es_es: Pseudo-hashes están obsoletas desde Perl 5.8.0 y serán eliminadas en Perl 5.10.0, vea L<perl58delta> para más detalles.

source: not (?:) no capture REGEX CHARCLASSES
es_es: not (?:) sin captura CLASES CARACTERES EXP. REG.

source: Not necessarily all are available on your system.
es_es: No necesariamente todos están disponibles en su sistema.

source: my $s = "The black cat climbed the green tree";
es_es: my $s = "El gato negro subió el árbol verde";

source: printf '<%6s>', 12; # prints "< 12>"
es_es: printf '<%6s>', 12; # imprime "< 12>"

source: Also no attention is paid to C<\c\> (multichar control char syntax) during this search.
es_es: Tampoco se presta atención a C<\c\> (sintaxis multicarácter de control) durante esta búsqueda.

source: 3 - If a circular reference is found, we fall back to referential equality.
es_es: 3 - Si se encuentra una referencia circular, regresamos a la igualdad referencial.

source: ($dev, $ino, undef, undef, $uid, $gid) = stat($file);
es_es: ($dev, $ino, undef, undef, $uid, $gid) = stat($archivo);

source: ($map{'red'}, $map{'blue'}, $map{'green'}) = (0x00f, 0x0f0, 0xf00);
es_es: ($map{'rojo'}, $map{'azul'}, $map{'verde'}) = (0x00f, 0x0f0, 0xf00);

source: Being strings, and thus of arbitrary length, there is no practical limit for the exponent or number of decimal digits for these numbers.
es_es: Al ser cadenas y, por tanto, al tener una longitud arbitraria, no existe un límite práctico para el exponente o el número de dígitos decimales para estos números.

source: The three principal virtues of a programmer are Laziness, Impatience, and Hubris.
es_es: Las tres virtudes principales de un buen programador son la pereza, la impaciencia y la confianza en sí mismo.

source: If you want to take advantage of this new implicit dereferencing behavior, go right ahead: it makes code easier on the eye and wrist.
es_es: Si desea aprovecharse de este nuevo comportamiento de desreferencia implícita, adelante: hace el código más fácil para el ojo y la muñeca.

source: ($whitewashed = $string) =~ s/()/ /g; # parens avoid magic s// /
es_es: ($espaciolimpio = $string) =~ s/()/ /g; # paréntesis evitan la magia de s// /

source: chown $uid, $gid, @filenames;
es_es: chown $uid, $gid, @archivos;

source: Perl is a large and complex system that's used for everything from knitting to rocket science.
es_es: Perl es un sistema grande y complejo que se utiliza para todo, desde hacer calceta a la ciencia de los cohetes.

source: C<FE<lt>E<gt>> should be the only Pod code for file names, but as most Pod formatters render it as italic, Unix and Windows paths with their slashes and backslashes may be less readable, and better rendered with C<CE<lt>E<gt>>.
es_es: C<FE<lt>E<gt>> debe ser el único código Pod para nombres de archivo, pero como la mayoría de los formateadores de Pod lo muestran en cursiva, los caminos Unix y Windows con sus barras y contrabarras pueden hacerlo menos legible, por lo que es mejor mostrarlo con C<CE<lt>E<gt>>.

source: =head2 Unicode interpretation of \w, \d, \s, and the POSIX character classes redefined.
es_es: =head2 Redefinidas las interpretaciones Unicode de \w, \d, \s, y las clase carácter POSIX.

source: Another use for typeglobs is to pass filehandles into a function or to create new filehandles.
es_es: Otro uso para los typeglobs es pasar identificadores de archivo en una función o para crear nuevos identificadores de archivo.

source: String modifying combinations for case and quoting such as C<\Q>, C<\U>, and C<\E> are not recognized.
es_es: Combinaciones de modificación de caracteres para cambios de tamaño de caja y entrecomillado, como C<\Q>, C<\U>, y C<\E>, no son reconocidos.

source: This behaviour is the same as a C<while> loop conditional.
es_es: Este comportamiento es el mismo que en la condición de un bucle C<while>.

source: This construct is useful for optimizations of what would otherwise be "eternal" matches, because it will not backtrack (see L<"Backtracking">).
es_es: Esta construcción es útil para la optimización de lo que, en caso contrario, serían coincidencias "eternas", porque no va a dar marcha atrás (vea L<"Retroceso">).

source: Thus Perl returns true on success and false on failure, yet you can still easily determine the actual value returned by the operating system:
es_es: Así, Perl devuelve verdadero en éxito y falso en caso de error, por lo que aún podemos determinar el valor actual devuelto por el sistema operativo:

source: (See also L<Integer Arithmetic> and L<Bitwise String Operators>.) Note that the width of the result is platform-dependent: ~0 is 32 bits wide on a 32-bit platform, but 64 bits wide on a 64-bit platform, so if you are expecting a certain bit width, remember to use the "&" operator to mask off the excess bits.
es_es: (Vea también L<Aritmética entera> y L<Operadores de bit en cadenas>). Tenga en cuenta que el ancho del resultado depende de la plataforma: ~0 es de 32 bits de ancho en una plataforma de 32 bits, pero 64 bits de ancho en una plataforma de 64 bits, así que si está esperando por un determinado ancho de bits, recuerde utilizar el operador & para enmascarar los bits excedentes.

source: perlos390 Perl notes for OS/390
es_es: perlos390 Notas para OS/390

source: Beginning with v5.6.0, Perl attempts to flush all files opened for output before the exec, but this may not be supported on some platforms (see L<perlport>).
es_es: A partir de la versión v5.6.0, Perl intenta vaciar todos los archivos abiertos para salida antes de ejecutar exec, pero esto puede no estar soportado en algunas plataformas (ver L<perlport>).

source: Inclusion of library modules is better done with the C<use> and C<require> operators, which also do automatic error checking and raise an exception if there's a problem.
es_es: La inclusión de bibliotecas de módulos es mejor hacerla con los operadores C<use> y C<require>, que también hacen una comprobación automática de errores y generan una excepción si existe algún problema.

source: There are also several utilities which are used by the Perl distribution itself as part of the install process.
es_es: algunas de ellas se usan durante el proceso de instalación de la distribución.

source: # open for input, reusing the fileno of $fd
es_es: # abrir para lectura, reutilizando el número de descriptor de $fd

source: my $db = tie %hash, 'DB_File', $filename, O_CREAT|O_RDWR, 0666, $DB_HASH
es_es: my $db = tie %hash, 'DB_File', $archivo, O_CREAT|O_RDWR, 0666, $DB_HASH

source: =item sprintf FORMAT, LIST X<sprintf>
es_es: =item sprintf FORMATO, LISTA X<sprintf>

source: perl584delta Perl changes in version 5.8.4
es_es: perl584delta Cambios en la versión 5.8.4

source: Suppose we parse text with comments being delimited by C<#> followed by some optional (horizontal) whitespace.
es_es: Supongamos que analiza un texto con comentarios que están delimitados por C<#> seguido por algunos espacios en blanco (horizontales) opcionales.

source: This is particularly useful for matching path names that contain "/", to avoid LTS (leaning toothpick syndrome).
es_es: Esto es particularmente útil para hacer coincidir los nombres de ruta que contienen "/", para evitar el "síndrome del palillo de dientes".

source: Calling binmode() normally flushes any pending buffered output data (and perhaps pending input data) on the handle.
es_es: Llamando a binmode(), normalmente vaciará cualquier dato pendiente que esté almacenado en la salida (y quizás datos pendientes a la entrada) del identificador de archivo.
